tap "homebrew/bundle"
tap "homebrew/cask-fonts"
tap "homebrew/services"
tap "jandedobbeleer/oh-my-posh"
# Clone of cat(1) with syntax highlighting and Git integration
brew "bat"
# Generate compilation database for clang tooling
brew "bear"
# Cross-platform make
brew "cmake"
# Documentation for CMake
brew "cmake-docs"
# Modern, maintained replacement for ls
brew "eza"
# Command-line fuzzy finder written in Go
brew "fzf"
# GNU compiler collection
brew "gcc"
# GitHub command-line tool
brew "gh"
# Distributed revision control system
brew "git"
# Syntax-highlighting pager for git and diff output
brew "git-delta"
# Open source programming language to build simple/reliable/efficient software
brew "go"
# Database migrations CLI tool
brew "golang-migrate"
# Go Language's command-line interface for database migrations
brew "goose"
# Interpreted, interactive, object-oriented programming language
brew "python@3.13"
# User-friendly cURL replacement (command-line HTTP client)
brew "httpie"
# Simple terminal UI for git commands
brew "lazygit"
# Pager program similar to more
brew "less"
# Utility for directing compilation
brew "make"
# Node version management
brew "n"
# Ambitious Vim-fork focused on extensibility and agility
brew "neovim"
# Highly capable, feature-rich programming language
brew "perl"
# Interpreted, interactive, object-oriented programming language
brew "python@3.11"
# Safe, concurrent, practical language
brew "rust"
# Substitute for classic 'make' tool with autoconf/automake functionality
brew "scons"
# Low-level access to audio, keyboard, mouse, joystick, and graphics
brew "sdl3"
# Generate type safe Go from SQL
brew "sqlc"
# Programmatically correct mistyped console commands
brew "thefuck"
# Official tldr client written in Rust
brew "tlrc"
# Terminal multiplexer
brew "tmux"
# Vi 'workalike' with many additional features
brew "vim"
# Watch files and take action when they change
brew "watchman"
# Command-line client for WebSockets
brew "websocat"
# Access X11 clipboards from the command-line
brew "xclip"
# Programming language designed for robustness, optimality, and clarity
brew "zig"
# Shell extension to navigate your filesystem faster
brew "zoxide"
# UNIX shell (command interpreter)
brew "zsh"
# Fish-like fast/unobtrusive autosuggestions for zsh
brew "zsh-autosuggestions"
# Fish shell like syntax highlighting for zsh
brew "zsh-syntax-highlighting"
# Application launcher and productivity software
cask "alfred"
# Chromium based browser
cask "arc"
# Voice and text chat software
cask "discord"
# App to build and share containerised applications and microservices
cask "docker"
# Client for the Dropbox cloud storage service
cask "dropbox"
cask "font-fira-code"
cask "font-fira-code-nerd-font"
cask "font-hack"
cask "font-hack-nerd-font"
cask "font-meslo-for-powerline"
cask "font-meslo-lg-nerd-font"
# Web browser
cask "google-chrome"
# Client for the Google Drive storage service
cask "google-drive"
# Terminal emulator as alternative to Apple's Terminal app
cask "iterm2"
# Provides updates to various Microsoft products
cask "microsoft-auto-update"
# Meet, chat, call, and collaborate in just one place
cask "microsoft-teams"
# App to write, plan, collaborate, and get organised
cask "notion"
# Move and resize windows using keyboard shortcuts or snap areas
cask "rectangle"
# .NET IDE
cask "rider"
# PDF reader and note-taking application
cask "skim"
# Music streaming service
cask "spotify"
# Video game digital distribution service
cask "steam"
# Open-source code editor
cask "visual-studio-code"
vscode "aaron-bond.better-comments"
vscode "adpyke.codesnap"
vscode "adpyke.vscode-sql-formatter"
vscode "albert.tabout"
vscode "alexcvzz.vscode-sqlite"
vscode "arcticicestudio.nord-visual-studio-code"
vscode "bradlc.vscode-tailwindcss"
vscode "catppuccin.catppuccin-vsc"
vscode "cocopon.iceberg-theme"
vscode "dejmedus.tailwind-sorter"
vscode "dracula-theme.theme-dracula"
vscode "drewxs.tokyo-night-dark"
vscode "dsznajder.es7-react-js-snippets"
vscode "dunstontc.viml"
vscode "eamodio.gitlens"
vscode "ecmel.vscode-html-css"
vscode "enkia.tokyo-night"
vscode "equinusocio.vsc-material-theme"
vscode "equinusocio.vsc-material-theme-icons"
vscode "esbenp.prettier-vscode"
vscode "formulahendry.auto-rename-tag"
vscode "geequlim.godot-tools"
vscode "github.github-vscode-theme"
vscode "johnpapa.winteriscoming"
vscode "k--kato.docomment"
vscode "kleber-swf.unity-code-snippets"
vscode "lamarcke.kanagawa-black"
vscode "ms-azuretools.vscode-docker"
vscode "ms-dotnettools.csdevkit"
vscode "ms-dotnettools.csharp"
vscode "ms-dotnettools.vscode-dotnet-runtime"
vscode "ms-dotnettools.vscodeintellicode-csharp"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode.cpptools"
vscode "mtxr.sqltools"
vscode "mvllow.rose-pine"
vscode "n7n.n7-vscode-themes"
vscode "pkief.material-icon-theme"
vscode "qufiwefefwoyn.kanagawa"
vscode "rust-lang.rust-analyzer"
vscode "rvest.vs-code-prettier-eslint"
vscode "tamasfe.even-better-toml"
vscode "teabyii.ayu"
vscode "vscodevim.vim"
vscode "yoavbls.pretty-ts-errors"
vscode "yukina.nord-dark"
vscode "yukina.yukinord"
vscode "yzane.markdown-pdf"
vscode "yzhang.markdown-all-in-one"
vscode "zhuangtongfa.material-theme"
